### Bases de dades noSQL. MongoDB

In [1]:
import pandas as pd
import pymongo
from pymongo import MongoClient

##### Connect to the local server and the database

In [2]:
myclient = pymongo.MongoClient("mongodb://localhost:27017/")

In [3]:
connection = MongoClient()
db = myclient['shopping']
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'shopping')

terminal commands
cd data
mkdir db
mongod --dbpath ~/data/db

In [6]:
#Collection list
collection = db.list_collection_names()
collection

['Shops', 'Clients', 'Purchases', 'Products']

In [7]:
# Shops collection content

mycol = db["Shops"]

for x in mycol.find({},{"_id":0}):
  print(x)

{'name': 'Fresh', 'type': 'Fruit & Vegetables', 'location': {'addres': 'Jamestown Road, 5', 'PC': 'NW1'}}
{'name': 'Nemo', 'type': 'Fish Mongers', 'location': {'addres': 'Tottenham Court Road, 124', 'PC': 'W1C'}}
{'name': 'Beat Box', 'type': 'Wine & Liquor', 'location': {'addres': 'Charlotte Street, 32', 'PC': 'W1C'}}
{'name': 'Superama', 'type': 'Supermarket', 'location': {'addres': 'Culiacan 40', 'PC': 'NW6'}}

In [9]:
# Clients collection content

mycol = db["Clients"]

for x in mycol.find({},{"_id":0}):
  print(x)

{'name': 'Robert', 'Surname': 'Smith', 'Age': 53}
{'name': 'Beth', 'Surname': 'Gibbons', 'Age': 44}
{'name': 'Max', 'Surname': 'Ritter', 'Age': 28}
{'name': 'Jo', 'Surname': 'Grant', 'Age': 62}

In [10]:
# Products collection content

mycol = db["Products"]

for x in mycol.find({},{"_id":0}):
  print(x)

{'product': 'Pears', 'type': 'fruit', 'price': Decimal128('2.90')}
{'product': 'Oranges', 'type': 'fruit', 'price': Decimal128('2.50')}
{'product': 'Green beans', 'type': 'Vegetable', 'price': Decimal128('4.50')}
{'product': 'Potatoes', 'type': 'Vegetable', 'price': Decimal128('2.50')}
{'product': 'Wallnuts', 'type': 'Nuts', 'price': Decimal128('7.50')}
{'product': 'Pistachios', 'type': 'Nuts', 'price': Decimal128('14.50')}
{'product': 'Cod', 'type': 'Fish', 'price': Decimal128('10.50')}
{'product': 'Sea Bass', 'type': 'Fish', 'price': Decimal128('13.50')}
{'product': 'Mussels', 'type': 'Shellfish', 'price': Decimal128('9.00')}
{'product': 'Clams', 'type': 'Shellfish', 'price': Decimal128('6.50')}
{'product': 'Octopus', 'type': 'Seafood', 'price': Decimal128('11.00')}
{'product': 'Squid', 'type': 'Seafood', 'price': Decimal128('7.00')}
{'product': 'Tia Maria', 'type': 'Liquor', 'price': Decimal128('21.00')}
{'product': 'Limoncello', 'type': 'Liquor', 'price': Decimal128('15.50')}
{'product': 'Tonic Water', 'type': 'Soft_drink', 'price': Decimal128('3.50')}
{'product': 'Soda', 'type': 'Soft_drink', 'price': Decimal128('2.50')}
{'product': 'Turbio', 'type': 'Wine', 'price': Decimal128('2.50')}
{'product': 'Muga', 'type': 'Wine', 'price': Decimal128('4.00')}

In [11]:
df = pd.read_csv('../s17_tasca/shopping.csv', engine = 'python')
df.drop(['Unnamed: 0'], axis=1, inplace=True)
df.head(2)

,tktcode,date,price,quantity,Subtotal,product,shop,shop_type,Client,Prod_type
0,tk1,2021-08-18,2.9,10,29.0,Pears,Superama,Supermarket,Robert Smith,Fruit
1,tk1,2021-08-18,4.5,1,4.5,Green beans,Superama,Supermarket,Robert Smith,Vegetable

In [12]:
# Will use the pandas database to fill the Purchases collectioon

import json
records = json.loads(df.T.to_json()).values()

In [ ]:
db.Purchases.insert(records)

In [ ]:
# Purchases collection content

mycol = db["Purchases"]

for x in mycol.find({},{"_id":0}):
  print(x)

In [40]:
# Insert extra data insto the database (with no client name to see the result in the pandas frame)
mycol = db["Purchases"]

mylist = [
{"tktcode":"tk6","date":"2021-08-21","price":2.9,"quantity":15,"Subtotal":43.5,"product":"Pears","shop":"Fresh","shop_type":"Fruit & Vegetab","Prod_type":"Fruit"},
{"tktcode":"tk6","date":"2021-08-21","price":2.5,"quantity":10,"Subtotal":25.0,"product":"Oranges","shop":"Fresh","shop_type":"Fruit & Vegetab","Prod_type":"Fruit"},
{"tktcode":"tk6","date":"2021-08-21","price":4.5,"quantity":7,"Subtotal":31.5,"product":"Green beans","shop":"Fresh","shop_type":"Fruit & Vegetab","Prod_type":"Vegetable"},
{"tktcode":"tk6","date":"2021-08-21","price":2.5,"quantity":5,"Subtotal":12.5,"product":"Potatoes","shop":"Fresh","shop_type":"Fruit & Vegetab","Prod_type":"Vegetable"}
]

mycol.insert_many(mylist)

<br><br><br><br><br>
##### Convert the purchases collection into different panda frames

In [41]:
collection = db.Purchases
data = pd.DataFrame(list(collection.find()))

In [86]:
data.head()

,_id,tktcode,date,price,quantity,Subtotal,product,shop,shop_type,Client,Prod_type
0,612387845b58440301eb879e,tk1,2021-08-18,2.9,10,29.0,Pears,Superama,Supermarket,Robert Smith,Fruit
1,612387845b58440301eb879f,tk1,2021-08-18,4.5,1,4.5,Green beans,Superama,Supermarket,Robert Smith,Vegetable
2,612387845b58440301eb87a0,tk1,2021-08-18,2.5,2,5.0,Potatoes,Superama,Supermarket,Robert Smith,Vegetable
3,612387845b58440301eb87a1,tk1,2021-08-18,10.5,1,10.5,Cod,Superama,Supermarket,Robert Smith,Fish
4,612387845b58440301eb87a2,tk1,2021-08-18,3.5,10,35.0,Tonic Water,Superama,Supermarket,Robert Smith,Soft_drink

In [94]:
data.groupby(['shop'])['Subtotal'].sum()

shop
Beat Box     240.0
Fresh        709.5
Nemo         181.5
Superama    1173.3
Name: Subtotal, dtype: float64

In [96]:
#Find all purchases @ Fresh, don't show the ID, date and tiketcode
 
mydoc = mycol.find({ "shop": "Fresh" },{ "_id": 0,"tktcode": 0,"date": 0 })

fresh_list = []
for x in mydoc:
  fresh_list.append(x)

In [97]:
# Converting to the DataFrame
fresh = pd.DataFrame(fresh_list)

In [98]:
fresh.head()

,price,quantity,Subtotal,product,shop,shop_type,Client,Prod_type
0,2.9,10,29.0,Pears,Fresh,Fruit & Vegetab,Beth Gibbons,Fruit
1,2.5,10,25.0,Oranges,Fresh,Fruit & Vegetab,Beth Gibbons,Fruit
2,4.5,10,45.0,Green beans,Fresh,Fruit & Vegetab,Beth Gibbons,Vegetable
3,2.5,10,25.0,Potatoes,Fresh,Fruit & Vegetab,Beth Gibbons,Vegetable
4,7.5,10,75.0,Wallnuts,Fresh,Fruit & Vegetab,Beth Gibbons,Nuts

In [99]:
fresh.describe(include='all')

,price,quantity,Subtotal,product,shop,shop_type,Client,Prod_type
count,19.000000,19.000000,19.000000,19,19,19,15,19
unique,NaN,NaN,NaN,5,1,1,1,3
top,NaN,NaN,NaN,Oranges,Fresh,Fruit & Vegetab,Beth Gibbons,Fruit
freq,NaN,NaN,NaN,4,19,19,15,8
mean,3.794737,9.842105,37.342105,NaN,NaN,NaN,NaN,NaN
std,1.822536,1.803181,18.848116,NaN,NaN,NaN,NaN,NaN
min,2.500000,5.000000,12.500000,NaN,NaN,NaN,NaN,NaN
25%,2.500000,10.000000,25.000000,NaN,NaN,NaN,NaN,NaN
50%,2.900000,10.000000,29.000000,NaN,NaN,NaN,NaN,NaN
75%,4.500000,10.000000,45.000000,NaN,NaN,NaN,NaN,NaN
max,7.500000,15.000000,75.000000,NaN,NaN,NaN,NaN,NaN

In [75]:
#Find all purchases where +20 was spent on a single product
mydoc = mycol.find({ "Subtotal": { "$gt": 20 } },{ "_id": 0 ,"product": 1,"Subtotal": 1, "shop": 1,"Client": 1})

m20list = []
for x in mydoc:
  m20list.append(x)

# Converting to the DataFrame
m20 = pd.DataFrame(m20list)
m20.head()

   Subtotal      product      shop        Client
0      29.0        Pears  Superama  Robert Smith
1      35.0  Tonic Water  Superama  Robert Smith
2      37.5         Soda  Superama  Robert Smith
3      29.0        Pears     Fresh  Beth Gibbons
4      25.0      Oranges     Fresh  Beth Gibbons

In [92]:
m20.groupby(['Client'])['Subtotal'].sum()

Client
Beth Gibbons    777.0
Jo Grant        108.0
Max Ritter      598.8
Robert Smith    304.5
Name: Subtotal, dtype: float64

In [85]:
m20.describe(include='all')

         Subtotal product      shop        Client
count   54.000000      54        54            51
unique        NaN      12         4             4
top           NaN   Pears  Superama  Beth Gibbons
freq          NaN      10        27            21
mean    34.968519     NaN       NaN           NaN
std     12.895133     NaN       NaN           NaN
min     21.000000     NaN       NaN           NaN
25%     25.000000     NaN       NaN           NaN
50%     33.000000     NaN       NaN           NaN
75%     37.500000     NaN       NaN           NaN
max     75.000000     NaN       NaN           NaN

In [82]:
m20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Subtotal  54 non-null     float64
 1   product   54 non-null     object
 2   shop      54 non-null     object
 3   Client    51 non-null     object
dtypes: float64(1), object(3)
memory usage: 1.8+ KB